In [1]:
import pandas as pd

## Series

In [3]:
s = pd.Series([10,20,30,40])

In [4]:
s

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

In [8]:
s2 = pd.Series([23,45,66,88,56,78], index=["a","b","c","d","e","f"])

In [9]:
s2

a    23
b    45
c    66
d    88
e    56
f    78
dtype: int64

In [10]:
s2["a"]

np.int64(23)

## DataFrame

In [11]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

In [12]:
df = pd.DataFrame(data)

In [13]:
df

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [14]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
df.columns

Index(['name', 'age', 'city'], dtype='object')

In [16]:
data = [['harry',34],["shreya",45], ["yash",49]]

In [17]:
data

[['harry', 34], ['shreya', 45], ['yash', 49]]

In [21]:
pd.DataFrame(data, columns=["Name","Marks"])

     Name  Marks
0   harry     34
1  shreya     45
2    yash     49

In [22]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35]
}

In [23]:
data

{'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}

In [24]:
df = pd.DataFrame(data)

In [25]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [26]:
import numpy as np

In [28]:
arr = np.array([[1,2],[3,4]])

In [29]:
df = pd.DataFrame(arr, columns=["A","B"])

In [30]:
df

   A  B
0  1  2
1  3  4

In [32]:
df = pd.read_excel("data.xlsx")

In [33]:
df

      Name School  Marks
0  shubham    XCV     23
1    priya    EDF     33
2     yash    SSS     88
3    sanvi    BLD     99
4     tanu     GG     77
5     sonu    DDF     66
6    tanay    BBL     56

In [36]:
df = pd.read_csv("data.csv")

In [37]:
df

      Name School  Marks
0  shubham    XCV     23
1    priya    EDF     33
2     yash    SSS     88
3    sanvi    BLD     99
4     tanu     GG     77
5     sonu    DDF     66
6    tanay    BBL     56

In [40]:
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [41]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [42]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [43]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [45]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [46]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [47]:
df.shape

(244, 7)